#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main()
{
	 //指针指的是指针变量， 是用来存放内存地址的变量
		//指针就是地址
	//内存被划分成一个个的内存单元 每个内存单元大小是1字节
	//每个字节的内的村单元都有一个编号就是地址就是指针
	//在32位机器是4个字节 64位是8个字节
	//int a = 10;
	//int* pa = &a;
	//*pa = 20;
	//printf("%d\n", a);

	
	//int*的指针跳过四个字节
	//char* 跳过一个
	//shaor*跳过2
	//double跳过8个


	//野指针 指针指向是随机的 不受控制的
	//1。指针未初始化

	//2.指针越界访问

	//3.指针指向的空间被释放

	//如何规避野指针
	//1.指针初始化
	//2.小心指针越界
	//3.指针指向空间释放
	//4.避免返回局部变量的地址
	//5.指针使用之前检查有效性
	


	//指针运算
	//int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
	//int* p = arr;
	//int i = 0;
	//for (i = 0; i < 10; i++)
	//{
	//	printf("%d", *(p + i));
	//	//p指向的是数组首元素
	//	//p+i是数组下表为i的地址
	//	//p+i 跳过了 i*sizeof(int)个字节

	//}


	////二级指针
	//int a = 10;
	//int* p = &a;
	////p是一级指针 p也有自己的地址
	//int* * pp= &p;//pp是二级指针变量



	return 0;
}